In [28]:
import pandas as pd

In [29]:
df_shopping = pd.read_csv("shopping_data.csv", encoding = "ISO-8859-1")
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [30]:
# Columns
df_shopping.columns.tolist()

['CustomerID', 'Card Member', 'Age', 'Annual Income', 'Spending Score (1-100)']

In [31]:
# column data types
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [32]:
# Find null values
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null values.")

Column CustomerID has 0 null values.
Column Card Member has 2 null values.
Column Age has 2 null values.
Column Annual Income has 0 null values.
Column Spending Score (1-100) has 1 null values.

In [33]:
# drop null rows
df_shopping = df_shopping.dropna()

In [34]:
# find any duplicate rows
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

In [35]:
# Remove the CustomerID column which is irrelevant
df_shopping.drop(columns= ["CustomerID"], inplace = True)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [36]:
# Transform the Card Member column to 0 or 1 instead of string
def change_string(member):
    if member == "Yes":
        return 1
    else: 
        return 0

df_shopping["Card Member"] = df_shopping ["Card Member"].apply(change_string)
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [37]:
# scale down annual income
df_shopping["Annual Income"] = df_shopping["Annual Income"] / 1000
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [38]:
# Remove spaces and numbers from column names
df_shopping = df_shopping.rename(columns = {"Card Member": "Card_member", "Annual Income": "Annual_Income", "Spending Score (1-100)": "Spend_score"})

df_shopping.head()

   Card_member   Age  Annual_Income  Spend_score
0            1  19.0           15.0         39.0
1            1  21.0           15.0         81.0
2            0  20.0           16.0          6.0
3            0  23.0           16.0         77.0
4            0  31.0           17.0         40.0

In [39]:
# Saving cleaned data
file_path = "shopping_data_cleaned.csv"
df_shopping.to_csv(file_path, index=False)